In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({"Fruits":["apple","pear","banana","watermelon"],"Price":[1.2,1.4,2.3,4.2],"Sales":[11,45,25,16]})
df

       Fruits  Price  Sales
0       apple    1.2     11
1        pear    1.4     45
2      banana    2.3     25
3  watermelon    4.2     16

In [2]:
# 直接使用行或者列标签(选取df的Fruits和Price两列)
df[['Fruits','Price']]

       Fruits  Price
0       apple    1.2
1        pear    1.4
2      banana    2.3
3  watermelon    4.2

In [4]:
# 选取df的第1到第3行
df[1:4]

       Fruits  Price  Sales
1        pear    1.4     45
2      banana    2.3     25
3  watermelon    4.2     16

In [6]:
# loc函数(选取df的第2到3行和Price、Sales对应的列)
df.loc[2:3,'Price':'Sales']

   Price  Sales
2    2.3     25
3    4.2     16

In [7]:
# loc函数(选取所有的行和Fruits、Sales对应的列)
df.loc[:,['Fruits','Sales']]

       Fruits  Sales
0       apple     11
1        pear     45
2      banana     25
3  watermelon     16

In [8]:
# iloc函数(选取df的第2到3行和第1到2列)
df.iloc[2:4,1:3]

   Price  Sales
2    2.3     25
3    4.2     16

In [10]:
# iloc函数(选取所有的行和第0、2列)
df.iloc[:,[0,2]]

       Fruits  Sales
0       apple     11
1        pear     45
2      banana     25
3  watermelon     16